CSI API ETABS v1

# cFrameObjDeleteLateralBracing Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int DeleteLateralBracing(
    	string Name,
    	int MyType = 3,
    	eItemType ItemType = eItemType.Objects
    )

    Function DeleteLateralBracing (
    	Name As String,
    	Optional MyType As Integer = 3,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cFrameObj
    Dim Name As String
    Dim MyType As Integer
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.DeleteLateralBracing(Name,
    	MyType, ItemType)

    int DeleteLateralBracing(
    	String^ Name,
    	int MyType = 3,
    	eItemType ItemType = eItemType::Objects
    )

    abstract DeleteLateralBracing :
            Name : string *
            ?MyType : int *
            ?ItemType : eItemType
    (* Defaults:
            let _MyType = defaultArg MyType 3
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

MyType (Optional)

    Type: SystemInt32

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cFrameObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com